Repository: necrose99/Myaamia
Catalog: ilda_full.tmx
Source language: mia
Languages: en_us

source: ceek-
en_us: All

source: ceekamw-
en_us: Eat all of him

source: ceekantam-
en_us: Eat it all, Drink it all

source: ceekonc-
en_us: On all sides, both sides

source: ceemonkaahkašiwi-
en_us: Baptist preacher

source: ceenkwihtan-
en_us: Fall Creek

source: ceenkwihtanonki
en_us: Indianapolis

source: ciikaahkw-
en_us: Near, close to

source: ciikaahkwaapantani-
en_us: It appears close, it looks close

source: ciikalaw-
en_us: Plume (feather worn on head)

source: ciikamw-
en_us: Twins

source: ciikiaahkw-
en_us: Gigging Pole

source: ciikiw-
en_us: Gig (Fish), fish spear

source: ciikwaapiteehwi-
en_us: Pick one's teeth with something

source: ciilahki-
en_us: It is dense thicket, underbrush

source: ciilaten-
en_us: it is very cold

source: ciilaweem-
en_us: Be a near relative with him

source: ciileelim-
en_us: Like him, think well of him, think highly of him

source: ciileelintam-
en_us: Like it, think well of it

source: ciililaan-
en_us: It rains very hard

source: ciilitee-
en_us: It is very hot weather

source: ciiliteesi-
en_us: be hot, from weather

source: ciilwee-
en_us: Talk loudly

source: ciimaan-
en_us: Paddle, oar

source: ciimee-
en_us: Paddle, row (a boat, canoe)

source: ciinkwaahki-
en_us: Thunderclap

source: ciinkwaakan-
en_us: drum

source: ciinkweepi-
en_us: Sit, sit down

source: ciinkweepikaan-
en_us: Living room

source: ciinkweewaankan-
en_us: Thunder being feather

source: ciinkwi-
en_us: Thunder being

source: ciinkwia akook-
en_us: Spring peeper (pseudacris crucifer, frog)

source: ciinkwihtanwi siipiiw-
en_us: Gauley River (West Virginia)

source: ciipaahkamin-
en_us: Raccoon grape (Ampelopis cordata)

source: ciipay-
en_us: Corpse, Soul/spirit of the dead

source: ciišihtan-
en_us: flow heavily, abundantly

source: ciišim-
en_us: speak strongly to, argue with

source: ciišinaakosi-
en_us: He is disagreeable, evil

source: cilalosi-
en_us: Sweat

source: eecipoonkwaawisiip-
en_us: Butternut Creek (Indiana)

source: eecipoonkwi-
en_us: Snapping turtle (Chelydra serpentina)

source: eeh-
en_us: Where, when

source: eehi peehkihkweehwinta
en_us: Beauty parlor, salon

source: eehkawaapi-
en_us: Scout

source: eehkwa
en_us: Still, a while, hold it!

source: eehkwi
en_us: While, during, before

source: eehpiši
en_us: Time, when, ago

source: eehsahsen-
en_us: Fossil

source: eehsipan-
en_us: Raccoon (Procyon lotor), Quarter Dollar

source: eehsipana siipiiw-
en_us: Big Raccoon Creek

source: eekami
en_us: each, every

source: eekincikw-
en_us: Cashier

source: eelaakion-
en_us: Feast

source: eelaalaahšiwi-
en_us: Monkey

source: eelaamihtaakan-
en_us: Belief

source: eelaaminahiwi-
en_us: Preacher

source: eelikw-
en_us: Ant

source: eemhkookanekaa-
en_us: Gourd dancing

source: eemihkookan-
en_us: Gourd

source: eemihkwaan-
en_us: Pumpkin (Cucurbita pepo), Squash, crookneck, zucchini

source: eenaahkiikamen-
en_us: Floor

source: eentonamahwi-
en_us: Hunter

source: eephšihki-
en_us: Person with a small head

source: eephšikaateekan-
en_us: Little toe

source: eesaasaahsikw-
en_us: Tattoo Artist

source: eeseekiweek-
en_us: Cedar Waxwing (Bombycilla cedrorum)

source: eeteehsi-
en_us: War party leader, one who carries the war club

source: eewiyawiki-
en_us: Writer, author

source: eeyeeli-
en_us: Opossum (Didelphis virginiana)

source: eeyoonsaawikiš-
en_us: Eastern redbud (Cercis canadensis)

source: eeyoonseelehšia kook-
en_us: Gray tree frog (Hyla versicolor)

source: eešaahšahk-
en_us: Mud

source: eešaakan-
en_us: Hominy block

source: eešaakant-
en_us: Mortar

source: eešaakantaahkw-
en_us: Pestle (wooden)

source: ehkipešam-
en_us: Cut it straight

source: ehkwaahkosi-
en_us: Be short

source: ehkwaalawee-
en_us: Have a short tail

source: ehkwihtam-
en_us: Left over from eating

source: ehkwikolee-
en_us: Have a short nose

source: ehpenal-
en_us: Do to him, treat him a certain way

source: ehpenatoo-
en_us: Do something with it, to it

source: ehpesi-
en_us: Be high, tall

source: ehpihsaa-
en_us: Fly up high

source: el-
en_us: Say to him, call him something

source: elaahkaatam-
en_us: Throw it thus

source: elaapam-
en_us: Look at him so

source: elaapiikasi-
en_us: descend from, ancestor

source: elaatawee-
en_us: Speak a language

source: elaw-
en_us: Resemble him, look like him

source: eleelim-
en_us: think of him so

source: eleelintam-
en_us: Think of it so

source: elehpii-
en_us: it is so tall, so high

source: elehtam-
en_us: Hear it so

source: elehtaw-
en_us: Hear him so

source: elenanci-
en_us: Be right-handed

source: eleniwi-
en_us: Be a man

source: elešam-
en_us: Cut it thus

source: elini-
en_us: Be born

source: elwee-
en_us: Say so

source: ental-
en_us: Detain him (as a prisoner), have him there

source: etam-
en_us: Say it, call it

source: ešileni-
en_us: Do a certain way

source: ešim-
en_us: Say it to him

source: ešinaakosi-
en_us: Be a certain way

source: ešiteehee-
en_us: Think, feel a certain way

source: ešiteeheehpinal-
en_us: Comfort him

source: ešiteeheelotaw-
en_us: Feel a certain way about him

source: ešiteeheeyosi-
en_us: Intend something, have something in mind

source: -hciw-
en_us: Upper arm

source: -hkaat-
en_us: Foot

source: -hkahkwan-
en_us: shin

source: -hkan-
en_us: Leg, bone

source: -hkaš-
en_us: Nail

source: -hkiinšikw-
en_us: Eye

source: -hkiipiman-
en_us: breastbone, sternum

source: -hkinš-
en_us: Forehead

source: -hkitikwi-
en_us: Knee

source: -hkitin-
en_us: Vagina, vulva

source: -hkiwan-
en_us: Nose

source: -hkolay-
en_us: Blanket, robe, dress, shawl

source: -hkon-
en_us: Liver

source: -hkweekan-
en_us: Neck

source: -hpaleew-
en_us: chest, breast

source: -hpani
en_us: Lung

source: -hpikay-
en_us: rib

source: -hseens-
en_us: Elder brother, older brother

source: -hsem-
en_us: daughter-in-law

source: -htaamp-
en_us: The back of one's neck

source: -htawak-
en_us: Ear

source: -hteekwaan-
en_us: Neck gland

source: -hšiim-
en_us: Younger sibling

source: -hšimihs-
en_us: Niece (Cross-niece)

source: hoci
en_us: Hey! (used as an attention getter)

source: hohow-
en_us: Santa

source: -iihkaan-
en_us: Friend (of the same sex)

source: -iihkwan-
en_us: elbow

source: -iihtaaw-
en_us: man's brother-in-law (man's sister's husband)

source: -iik-
en_us: House, home

source: -iil-
en_us: bellybutton, navel

source: -iilakay-
en_us: Penis

source: -iilan-
en_us: someone's tongue

source: -iilanin-
en_us: it is someone's (possession)

source: -iilaw-
en_us: Portion of food, one's food

source: -iilhs-
en_us: Hair

source: -iilimw-
en_us: Cross-sex sibling-in-law (woman's brother-in-law, man's sister-in-law)

source: -iip-
en_us: arrow

source: -iipit-
en_us: Tooth

source: -iiyaw-
en_us: Body, self

source: ihkipakaamhkii-
en_us: It is blue clay

source: ihkipakahkatw-
en_us: Grass

source: ihkipakahki-
en_us: It is green land, it is a park

source: ihkipakiikin-
en_us: It is blue, green cloth, paper

source: ihkipakilee-
en_us: Be blue, green

source: ihkipakin-
en_us: It is blue, green

source: ihkipakiteehee-
en_us: Have a green heart

source: ihkipihsin-
en_us: It is straight, as a road or river

source: ihkisam-
en_us: Boil it down, evaporate it by heat

source: ihkwaa-
en_us: It is short

source: ihpahki-
en_us: It is high ground

source: ihpaten-
en_us: It is steep, a hill, a butte

source: ihpii-
en_us: It is tall

source: iihia
en_us: yes, okay, affirmative, you're welcome

source: iihkaaw-
en_us: American Bittern (Botaurus lentiginosus)

source: iihkalw-
en_us: Flowering Dogwood (Cornus florida)

source: iihkihtamink-
en_us: Watermelon (Citrullus vulgaris)

source: iihkipakaapiikw-
en_us: blue ribbon

source: iihkipakahk-
en_us: Green land, park

source: iihkipihsinonki
en_us: Peru, IN

source: iihkisamink-
en_us: Maple Syrup

source: iihkwakwaat-
en_us: American Robin (Turdus migratorius)

source: iihpaawal-
en_us: Mexican, Spaniard

source: iinaana
en_us: That (out of reach, animate)

source: iiniini
en_us: That (out of reach, inanimate)

source: iiyoowe
en_us: exclamation, be it from fear or in admiration, used only by men

source: iišiteehion-
en_us: Thought, mentality

source: ilaalaantee-
en_us: It is colored a certain way

source: ilaapyaat-
en_us: It is used (a certain way), is useful

source: ilaataweeyon-
en_us: Language

source: ilahkiiwi-
en_us: There is such going on, it happens that way

source: ilakintam-
en_us: Price it at a certain amount

source: ilakintee-
en_us: It costs, is priced

source: ileeši
en_us: But

source: ilekili-
en_us: Be so big, so large, of a certain size

source: iletii-
en_us: Say to each other

source: inko
en_us: (Future negative)

source: inohka asiipiom-
en_us: Illinois River

source: išihsen-
en_us: It lies a certain way, times are a certain way

source: išihtan-
en_us: It flows thus

source: išinaakwat-
en_us: It is a certain way

source: -kohšim-
en_us: Cross-sibling, cross-cousin

source: -kontaakan-
en_us: Throat

source: -kootay-
en_us: Skirt

source: -kwihs-
en_us: Son

source: -ky-
en_us: Mother (mother's sisters), mom

source: kaahkaahki-
en_us: Katydid (Tettigonia viridissima), Kaskaskia person

source: kaahkahw-
en_us: Clean him (as of fish, game, etc)

source: kaahkiihkw-
en_us: day

source: kaahkilookii-
en_us: Shave one's skin

source: kaahkimiihsitonaham-
en_us: Shave one's face

source: kaahkimiihsitonahiwi-
en_us: Barber

source: kaahp-
en_us: Quapaw person

source: kaahpa siipiiw-
en_us: Arkansas River

source: kaakaathswihsink-
en_us: Hexagon

source: kaakatakilenkwi-
en_us: Butterfly

source: kaakihšaahkatw-
en_us: Sycamore (Platanus occidentalis)

source: kaakiihsitaaki-
en_us: One who preserves things, Tribal Historic Preservation Officer

source: kaakiihsitaatii-
en_us: Preserve for each other

source: kaakiihsitoo-
en_us: Preserve it, make it last

source: kaakiitisi-
en_us: Be sore, in pain

source: kaakilaahkiihki-
en_us: Liar

source: kaanseenseemin-
en_us: Pecan (Carya illinoinensis)

source: kaanseenseepiiw-
en_us: Ohio River

source: kaanseepakaaniš-
en_us: Pecan tree (Carya illinoinensis)

source: kaapi-
en_us: Assistant to the chief, one who distributes goods

source: kaayociik-
en_us: Cucumber

source: kaayohsen-
en_us: Sandstone

source: kahcokaalakiinkwee-
en_us: Have heavy eyes, be sleepy

source: kahkeenš-
en_us: Weed

source: kahkeenšaahkw-
en_us: Weed stalk

source: kahkiiti-
en_us: American White Pelican (Pelecanus erythrorhynchos)

source: kahkiitiaahkw-
en_us: American spikenard (Aralia racemosa)

source: kahkiteemin-
en_us: Mayapple (fruit)

source: kahkiteemišaahkw-
en_us: Mayapple tree (Podophyllum peltatum)

source: kahoki-
en_us: Cahokia person

source: kahpakahki-
en_us: Be thick woods

source: kahšimon-
en_us: Canvas, linen

source: kakapaac-
en_us: Variously, in different ways

source: kakapaacinaakosion-
en_us: Diversity

source: kakiipihšii-
en_us: Be deaf

source: kakiipiinkweehol-
en_us: Blindfold him

source: kakikaleni-
en_us: Snail

source: kalaakalaal-
en_us: Downy Woodpecker (Picoides pubescens)

source: kalol-
en_us: speak to him

source: kaloosi-
en_us: Speak

source: kaloosion-
en_us: Word

source: kalootamaw-
en_us: Speak for him

source: kapeehsihtoo-
en_us: Take it across, ferry it across

source: kapeehšim-
en_us: take him across, ferry him across

source: kapeehšin-
en_us: Go across, cross a river

source: kapihkam-
en_us: Pass by it, get in front of it, leave it out

source: kapihkaw-
en_us: pass by him, get in front of him, omit him, leave him out

source: kapootwe
en_us: soon, after a while

source: katakakook-
en_us: Northern leopard frog (Lithobates pipiens), Southern leopard frog (Lithobates sphenocephalus), Pickerel frog (Lithobates palustris)

source: katonkwaam-
en_us: Be sleepy

source: katoocii-
en_us: Have to poop, defecate

source: katoohw-
en_us: Cherokee person

source: katoohwakimin-
en_us: Cherry (Domesticated)

source: katoohwakimišaahkw-
en_us: Cherry Tree

source: katoopihkwee-
en_us: Have to pee, urinate

source: katoopii-
en_us: Be thirsty

source: kawaham-
en_us: Fell a tree, chop a tree down

source: kawihsen-
en_us: Be fallen, topple over (as a tree)

source: kayohkam-
en_us: Blow it down, knock over by body

source: kašihkahw-
en_us: Stab him

source: kašihkahwaakan-
en_us: dagger

source: keehpakiikinki naapinaakan-
en_us: Coat (Winter)

source: keekaanahkisinaakan-
en_us: Boot

source: keekaanohši-
en_us: Mule (mulus)

source: keekaanoloohsi-
en_us: Rat

source: keekaanoonkwi-
en_us: Alligator (Alligator mississippiensis)

source: keekaanwikani-
en_us: Wasp (Bembix oculata)

source: keekaanwikaši-
en_us: Grizzly Bear (Ursus arctos horribilis)

source: keekaanwimin-
en_us: Banana

source: keekiiyosi-
en_us: Traveler

source: keentaawihkici-
en_us: Pintail Duck (Anas acuta)

source: keetweenci
en_us: Why

source: keetwi
en_us: What, what thing

source: keešihiweens-
en_us: Jesus

source: keešihiwi-
en_us: Creator, God

source: kihci-papikwan-
en_us: Cannon

source: kihcihtan-
en_us: big current, rapids

source: kihcikam-
en_us: Lake Michigan, Big lake, Ocean

source: kihcinaakwat-
en_us: It is important, significant, sacred

source: kihkaapiikah-
en_us: Draw him, draw on him

source: kihkaapiikaham-
en_us: Draw it, draw on it

source: kihkaapiikahiko-
en_us: Draw

source: kihkaham-
en_us: Choose it, pick out

source: kihkahw-
en_us: Choose him, select him

source: kihkamanhsi-
en_us: Kingfisher (Megaceryle alcyon)

source: kihkanši-
en_us: It burns intensely, it is a big hot fire

source: kihkatw-
en_us: Year

source: kihkeelim-
en_us: know him

source: kihkeelintam-
en_us: Know it

source: kihkihkišaahkw-
en_us: Cutting board, butcher block

source: kihkihsen-
en_us: It is photographed

source: kihkihsetaw-
en_us: Take a picture of it for him

source: kihkihsetoo-
en_us: Take a picture of it

source: kihkihsitaakan-
en_us: Camera

source: kihkihši-
en_us: Camp

source: kihkihšim-
en_us: Take a picture of him

source: kihkihšin-
en_us: Be photographed

source: kihkiinkwaakan-
en_us: A portrait (general)

source: kihkiinkwee-
en_us: Make a portrait (general)

source: kihkiinkweeh-
en_us: Make a portrait of him

source: kihkiinkweehšim-
en_us: Take his portrait, photograph his face

source: kihkiinkweehšin-
en_us: Portrait, photograph of one's face

source: kihkincin-
en_us: Hug him

source: kihkintoolaakan-
en_us: Sign, guide, doctrine, observance

source: kihkintooli-
en_us: Discern, recognize, take note

source: kihkišw-
en_us: Cut him (purposefully)

source: kihseelaakan-
en_us: Doorflap

source: kihsihsiinkwee-
en_us: wash one's face

source: kihtaahkw-
en_us: Tree trunk

source: kihšosi-
en_us: Widower

source: kiihci-
en_us: Male bird, rooster

source: kiihkaam-
en_us: scold him, talk roughly to him

source: kiihkaantamaw-
en_us: Scold him about it

source: kiihkaapiikasi-
en_us: The rope/thread breaks

source: kiihkaapiikihšinka mihcalaankw-
en_us: Saturn (planet)

source: kiihkaapiikin-
en_us: break him (rope/thread)

source: kiihkaapiišam-
en_us: Border, boundary, allotment

source: kiihkaham-
en_us: Break it open, cut it (by tool)

source: kiihkalaakan-
en_us: Basket

source: kiihkayonki
en_us: Fort Wayne, Indiana

source: kiihkihkaa-
en_us: It breaks, is broken

source: kiihkihkam-
en_us: Break it by foot, kicking

source: kiihkiihkišw-
en_us: Chop him up (repeatedly)

source: kiihkiihkw-
en_us: Peregrine falcon (Falco peregrinus)

source: kiihkikaateešw-
en_us: Cut off, amputate his foot

source: kiihkikanee-
en_us: Have a broken leg

source: kiihkinam-
en_us: Break it apart by hand

source: kiihkitoneen-
en_us: Choke him

source: kiihkišahki-
en_us: Cut grass, weeds

source: kiihkišam-
en_us: Cut it

source: kiihkišamaw-
en_us: Cut it off of him

source: kiihkoneehs-
en_us: Fish

source: kiihkoneehsihkii-
en_us: Go fishing (with a hand net or commercial fishing)

source: kiihpat-
en_us: It is dirty

source: kiihpeekin-
en_us: It is dirty cloth

source: kiihpeeyosi-
en_us: Be dirty

source: kiihpiinkwee-
en_us: Have a dirty face

source: kiihpinaakosi-
en_us: Appear dirty

source: kiihpoopii-
en_us: Have enough to drink

source: kiihsaa-
en_us: Be few in numbers

source: kiihsinsw-
en_us: A little (of something)

source: kiihtilaam-
en_us: Really, certainly, true enough, surely

source: kiihtilaamat-
en_us: it is prestigious, held in high regard

source: kiikaapw-
en_us: Kickapoo person

source: kiikiihsaa-
en_us: Recover quickly, come back to life quickly

source: kiikiihtan-
en_us: It flows with life

source: kiikilehšiwi-
en_us: Stallion

source: kiikion-
en_us: Captive, prisoner

source: kiikoo
en_us: thing, something

source: kiila
en_us: You (singular)

source: kiilhsooki
en_us: Month names

source: kiilhswaapiikw-
en_us: Watch Chain

source: kiilihsw-
en_us: Sun, Moon, Month, Clock

source: kiilihswaakan-
en_us: Calendar

source: kiilohkim-
en_us: Doubt him, contradict him

source: kiilohkiwee-
en_us: Deny something

source: kiiloona
en_us: We, us (inclusive)

source: kiilwa
en_us: You (plural)

source: kiimaacimwi-
en_us: Whisper

source: kiimi
en_us: secretly

source: kiimih-
en_us: Surprise him

source: kiimihpwi-
en_us: Eat secretly

source: kiimiteehee-
en_us: Keep one's feelings secret

source: kiimohsee-
en_us: sneak, creep along quietly

source: kiinaakw-
en_us: Happy

source: kiinaakwapi-
en_us: Be at ease, contented, happy

source: kiinaakwapih-
en_us: Make him contented, at ease, happy

source: kiinak-
en_us: Damn, dammit

source: kiinošiš-
en_us: Butternut, White Walnut (Juglans cinerea)

source: kiint-
en_us: just, also, recently, wait, hold on!

source: kiintaawee-
en_us: It is sharp

source: kiintawikolee-
en_us: It has a sharp tip, point, nose

source: kiinteelintaakaanhs-
en_us: Small computer, laptop, ipad, tablet

source: kiinteelintaakan-
en_us: Computer

source: kiintoo-
en_us: Sharpen it

source: kiinwaahkoohsi-
en_us: Sweet Potato (Ipomoea batata)

source: kiinšiw-
en_us: Buffalo bull, cow bull

source: kiinšiwa siipiiw-
en_us: Bull Creek (Kansas)

source: kiipahooteekaan-
en_us: Jail

source: kiipihkatw-
en_us: Iron, metal, steel, bell

source: kiipihkatwaapiikw-
en_us: Iron chain, cable or wire

source: kiiwaacimwi-
en_us: Spread news

source: kiiwahtekaa-
en_us: Dance around something

source: kiiwahtohsee-
en_us: Walk around, go around, avoid something

source: kiiweeli-
en_us: Laugh

source: kiiweeliinkwee-
en_us: Smile

source: kiiweešinaw-
en_us: Laugh at him

source: kiiwikawilotaw-
en_us: Visit him

source: kiiyaahkweepii-
en_us: Be drunk, get drunk

source: kiiyaahkweeyon-
en_us: wickedness, foolishness

source: kiiyapahtoo-
en_us: Run around, run about

source: kiišaakosi-
en_us: Growing, getting larger, wax (as of the moon)

source: kiišaan-
en_us: Bag, sack

source: kiišaanaahkw-
en_us: Leather bag

source: kiiših-
en_us: Make him, create him, finish him

source: kiišihtoo-
en_us: Make it, create it, finish it

source: kiišiinkwee-
en_us: Be ripe, mature corn

source: kiišiinkwi-
en_us: Ironweed (Vernonia spp.), Green Corn

source: kiišikat-
en_us: It is such a day

source: kiišikw-
en_us: Bead

source: kiišiniiki-
en_us: Grow up, come of age

source: kiišiniikihtoo-
en_us: Grow it

source: kiišiniikin-
en_us: It grows up, comes of age

source: kiišisaakan-
en_us: pan (for cooking)

source: kiišisam-
en_us: Finish cooking it

source: kiišisw-
en_us: Finish cooking him

source: kiišitee-
en_us: It is finished cooking

source: kilaahkii-
en_us: Tell a lie

source: kilahkwaakan-
en_us: Wampum Belt

source: kilahkwaan-
en_us: Speech

source: kilahkwal-
en_us: Speak to him, address him

source: kilekaapoohkii-
en_us: Mix liquids together

source: kilikaham-
en_us: Mix it by tool

source: kilikahtoo-
en_us: mix it (general)

source: kilikinam-
en_us: mix it by hand

source: kimote-
en_us: Steal

source: kimotem-
en_us: Steal from him

source: kineepikomeekw-
en_us: Eel (Anguilla rostrata)

source: kineepikw-
en_us: Snake (Agkistrodon contortrix)

source: kineepikwameekwa siipiiw-
en_us: Eel River (Northern Indiana)

source: kinohšami-
en_us: Otter (Lontra canadensis)

source: kinoon-
en_us: It is deep

source: kinoonk-
en_us: In deep water

source: kinoonteew-
en_us: Longhouse

source: kinoontipi-
en_us: Redhorse fish (Moxostoma macrolepidotum)

source: kinoosaapiikw-
en_us: Eastern Milk Snake (Lampropeltis triangulum triangulum)

source: kinoosaawi-
en_us: Cougar/Mountain Lion (Puma concolor), Panther (Panthera)

source: kinoosaawiaahkw-
en_us: Hop tree, Wafer Ash (Ptelea trifoloata)

source: kintehsi-
en_us: cormorant

source: kintiw-
en_us: golden eagle

source: kintohsee-
en_us: Walk fast

source: kintoohkiwi-
en_us: It is new

source: kinwaa-
en_us: It is long

source: kinwaahkihtoo-
en_us: Make it long

source: kinwaahkosi-
en_us: Be long

source: kinwaakwaan-
en_us: Coat, overcoat

source: kinwaapiikat-
en_us: it is a long string, cord

source: kinwalaniihsi-
en_us: Sharp shinned hawk (Accipiter striatus), Coopers hawk (Accipiter cooperii)

source: kinwikam-
en_us: Calumet River

source: kinwikolee-
en_us: Have a long nose, a long beak

source: kinšim-
en_us: Soon, swiftly

source: kipahaakan-
en_us: Lock, padlock

source: kipaham-
en_us: Shut it, obstruct it by tool

source: kipalwaakan-
en_us: Lid, cover of a pot

source: kipenaakan-
en_us: Dam

source: kipinhs-
en_us: Twig

source: kipiteehee-
en_us: Be uninterested, unfriendly, aloof

source: kipwihsaa-
en_us: It is shut, obstructed

source: kisaapiteehaakan-
en_us: Toothbrush

source: kisaham-
en_us: Wipe it, clean it off, wash

source: kiseleehsi-
en_us: Eastern Bluebird

source: kisihsaapiteehiko-
en_us: Brush teeth

source: kisihsalaakanaakan-
en_us: Kitchen sink

source: kisihsem-
en_us: Wash him

source: kisihsetoo-
en_us: Wash it

source: kisihsiinkwee-
en_us: Wash one's face

source: kisihsiinkweehw-
en_us: wash, wipe his face

source: kisihsiinkweekan-
en_us: Bathroom sink

source: kisihsinehkii-
en_us: Wash hands

source: kisihsinehkiiyaakan-
en_us: Wash basin

source: kisiiham-
en_us: Erase it, blot it out

source: kisimitiwee-
en_us: Wipe one's butt

source: kisimitiweehaakan-
en_us: Toilet paper

source: kitaham-
en_us: Dig it up

source: kitahkalw-
en_us: Ramrod

source: kitahsaakan-
en_us: Parched Corn

source: kitahw-
en_us: Dig him up, take him out

source: kiteephkwanonki
en_us: Prophetstown (Village at the confluence of the Tippecanoe and Wabash Rivers)

source: kiteepihkwana siipiiw-
en_us: Tippecanoe River (Indiana)

source: kiteepihkwanw-
en_us: Bigmouth buffalo fish (Ictiobus cyprinellus)

source: kitemaakeelim-
en_us: Take pity on him, have mercy on him

source: kitemaakih-
en_us: Abuse him, mistreat him

source: kito-
en_us: Sound, make the call of one's species (sound of an animal)

source: kiyaahkw-
en_us: Gull (Larus spp.)

source: kiyoši-
en_us: Old Man

source: kišaapihkaahkosaakan-
en_us: Stove, oven

source: kišaapihkaahkotee-
en_us: It is hot

source: kišaapihkam-
en_us: Hot Water

source: kišaapihkamii-
en_us: It is hot water

source: kišaapihkili-
en_us: Be hot, have a fever

source: kišaapihkisam-
en_us: Heat it, make it hot

source: kišaapihkitee-
en_us: It is hot

source: kišaawaahki-
en_us: It is hot weather

source: kišaham-
en_us: heat it up (by tool)

source: kišiikin-
en_us: Tickle him

source: kišiinkweehaakan-
en_us: Towel

source: kišiipitonisi-
en_us: Wild grape (Vitis aestivalis)

source: kišikileehsee-
en_us: Cough

source: kišim-
en_us: make him angry by speech, words

source: kišin-
en_us: It hurts

source: kocihtam-
en_us: Take a test

source: kocihtamaakan-
en_us: Test, exam

source: kocihtamaakii-
en_us: Test people, give a test, exam

source: kocihtamaw-
en_us: Test him about it

source: kociihs-
en_us: Bean

source: kociihsaapow-
en_us: Coffee

source: kociihsaapowi minehkwaakan-
en_us: Coffee cup, mug

source: kociihsaapowikaan-
en_us: coffee shop

source: kociihsapakwasiip-
en_us: Beanblossom Creek (Indiana)
